Cult0x7c/HSM-Firmware--STM32-/main.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2025 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "main.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include "cmox_crypto.h"
#include <string.h>
#include <stdio.h>
#include <stdbool.h>
#include "string.h"
#include "stm32g4xx_hal.h"

#include "stm32g4xx_hal_flash.h"
#include "stm32g4xx_hal_flash_ex.h"
/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */
/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */

/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/
CRC_HandleTypeDef hcrc;

RNG_HandleTypeDef hrng;

RTC_HandleTypeDef hrtc;

UART_HandleTypeDef huart2;
DMA_HandleTypeDef hdma_usart2_rx;

/* USER CODE BEGIN PV */

uint8_t single_byte;

#define SHARED_SECRET_SIZE 32  // ECDH Shared Secret (256-bit key -> 32 bytes)
uint8_t computed_secret[SHARED_SECRET_SIZE];  // Buffer to store shared secret
size_t computed_size;  // Size of shared secret


/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_DMA_Init(void);
static void MX_USART2_UART_Init(void);
static void MX_CRC_Init(void);
static void MX_RNG_Init(void);
static void MX_RTC_Init(void);
/* USER CODE BEGIN PFP */
#define PUTCHAR_PROTOTYPE int __io_putchar(int ch)
/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */
#define ECC_CURVE_PARAMS CMOX_ECC_SECP256R1_LOWMEM 	// Example curve (secp256r1)
#define RANDOM_BUFFER_SIZE 32                       // Size of the random buffer
#define ECC_PRIVATE_KEY_SIZE 32                     // Size for secp256r1 (256 bits / 8 = 32 bytes)
#define ECC_PUBLIC_KEY_SIZE 64                      // Public key (X and Y each 32 bytes)
#define MESSAGE_MAX_LEN 256   						// Maximum message length
#define SIGNATURE_SIZE 64     						// ECDSA signature (32-Byte R + 32-Byte S)
#define CMOX_SHA256_SIZE 32							// CMOX_SHA256_SIZE 32 byte
#define NUM_KEYS 3

#define LOG_FLASH_START_ADDR   0x0807F800U      // last page in 512KB flash
#define LOG_FLASH_PAGE_SIZE    2048U
#define LOG_ENTRY_SIZE         96
#define LOG_MAX_ENTRIES        (LOG_FLASH_PAGE_SIZE / LOG_ENTRY_SIZE)
#define FLASH_PAGE_SIZE LOG_FLASH_PAGE_SIZE  // ✅ Fixes the missing macro

#define FLASH_BASE_ADDR     0x08000000U
#define FLASH_PAGE_NUMBER   ((LOG_FLASH_START_ADDR - FLASH_BASE_ADDR) / FLASH_PAGE_SIZE)

uint8_t private_keys[NUM_KEYS][ECC_PRIVATE_KEY_SIZE]; // Array for private keys
uint8_t public_keys[NUM_KEYS][ECC_PUBLIC_KEY_SIZE];   // Array for public keys
size_t private_key_lens[NUM_KEYS], public_key_lens[NUM_KEYS];
int current_key_index = 0; // current used key

uint8_t random_buffer[RANDOM_BUFFER_SIZE];         // Random seed for private key generation

uint8_t working_buffer[4096];                      // Working buffer for ECC computations
cmox_ecc_handle_t ecc_ctx;                         // ECC context

// Empfangs- und Sende-Puffer
uint8_t message_buffer[MESSAGE_MAX_LEN];
uint8_t computed_hash[CMOX_SHA256_SIZE];
uint8_t computed_signature[SIGNATURE_SIZE];


typedef struct {
    uint32_t timestamp;
    char message[60];       // existing log message
    uint8_t hash[32];       // new field for chained hash (SHA-256)
} FlashLogEntry;

// Global: holds last known log hash (init with 0 or SHA256("GENESIS"))
uint8_t previous_log_hash[32] = {0};  // initialize to 0 on boot



void flash_log_event_with_data(const char *command, const char *data)
{
    RTC_TimeTypeDef sTime;
    RTC_DateTypeDef sDate;
    HAL_RTC_GetTime(&hrtc, &sTime, RTC_FORMAT_BIN);
    HAL_RTC_GetDate(&hrtc, &sDate, RTC_FORMAT_BIN);

    FlashLogEntry entry;

    // Format timestamp
    char timestamp[32];
    snprintf(timestamp, sizeof(timestamp), "%04d-%02d-%02d %02d:%02d:%02d",
             2000 + sDate.Year, sDate.Month, sDate.Date,
             sTime.Hours, sTime.Minutes, sTime.Seconds);

    // Combine timestamp + command + optional data
    if (data && strlen(data) > 0) {
        snprintf(entry.message, sizeof(entry.message), "[%s] %s | %s", timestamp, command, data);
    } else {
        snprintf(entry.message, sizeof(entry.message), "[%s] %s", timestamp, command);
    }

    entry.message[sizeof(entry.message) - 1] = '\0';

    // Prepare input for hash: previous hash + message
    uint8_t hash_input[32 + sizeof(entry.message)];
    memcpy(hash_input, previous_log_hash, 32);
    memcpy(hash_input + 32, entry.message, sizeof(entry.message));

    // Compute SHA-256 hash for current log entry
    cmox_hash_compute(
        CMOX_SHA256_ALGO,
        hash_input, sizeof(hash_input),
        entry.hash, 32,
        NULL
    );

    // Save the new hash as the latest
    memcpy(previous_log_hash, entry.hash, 32);

    // 🔐 Write to Flash
    HAL_FLASH_Unlock();
    uint32_t addr = LOG_FLASH_START_ADDR;

    for (int i = 0; i < LOG_MAX_ENTRIES; i++) {
        if (*(uint64_t *)addr == 0xFFFFFFFFFFFFFFFF) {
            const uint8_t *data_ptr = (const uint8_t *)&entry;
            for (int j = 0; j < sizeof(FlashLogEntry); j += 8) {
                uint64_t word;
                memcpy(&word, data_ptr + j, 8);
                HAL_FLASH_Program(FLASH_TYPEPROGRAM_DOUBLEWORD, addr + j, word);
            }
            HAL_FLASH_Lock();
            return;
        }
        addr += sizeof(FlashLogEntry);
    }

    HAL_FLASH_Lock();
}



