Cult0x7c/HSM-Firmware--STM32-/main.c
    // Send currently selected public key
    HAL_UART_Transmit(&huart2, public_keys[current_key_index], ECC_PUBLIC_KEY_SIZE, HAL_MAX_DELAY);

    HAL_UART_Transmit(&huart2, (uint8_t *)"[ENDKEY]\r\n", 10, HAL_MAX_DELAY); // Marker with newline

    // 🔐 Compute and log hash of the sent public key
    uint8_t pubkey_hash[32];
    cmox_hash_compute(CMOX_SHA256_ALGO,
                      public_keys[current_key_index],
                      ECC_PUBLIC_KEY_SIZE,
                      pubkey_hash,
                      sizeof(pubkey_hash),
                      NULL);

    char hex_string[65] = {0};
    for (int i = 0; i < 32; i++) {
        sprintf(&hex_string[i * 2], "%02X", pubkey_hash[i]);
    }

    char cmd[32];
    snprintf(cmd, sizeof(cmd), "SENDPUB[%d]", current_key_index);
    flash_log_event_with_data(cmd, hex_string);
}


void flush_uart_buffer(void) {
    uint8_t dummy;
    while (HAL_UART_Receive(&huart2, &dummy, 1, 10) == HAL_OK) {} // Leere den Buffer
}

void print_computed_hash(uint8_t *hash, size_t length) {
    char hash_str[65]; // 32 bytes * 2 characters per byte + null terminator

    for (size_t i = 0; i < length; i++) {
        snprintf(&hash_str[i * 2], 3, "%02X", hash[i]);  // Convert to hex string
    }

    // Send the computed hash over UART
    HAL_UART_Transmit(&huart2, (uint8_t *)"Computed Hash: ", 15, HAL_MAX_DELAY);
    HAL_UART_Transmit(&huart2, (uint8_t *)hash_str, strlen(hash_str), HAL_MAX_DELAY);
    HAL_UART_Transmit(&huart2, (uint8_t *)"\r\n", 2, HAL_MAX_DELAY);
}

void sign_message() {
	if (!is_current_key_valid()) {
	    HAL_UART_Transmit(&huart2, (uint8_t *)"No valid key available. Use GENKEY first.\r\n", 45, HAL_MAX_DELAY);
	    return;
	}

    cmox_ecc_retval_t retval;
    uint8_t random_data[32];
    size_t computed_size;
    uint8_t received_byte;
    size_t msg_index = 0;
    uint8_t message[MESSAGE_MAX_LEN];

    HAL_UART_Transmit(&huart2, (uint8_t *)"Waiting for message...\r\n", 24, HAL_MAX_DELAY);

    // Read message until we receive [ENDSIGN]
    while (msg_index < MESSAGE_MAX_LEN - 1) {
        HAL_UART_Receive(&huart2, &received_byte, 1, HAL_MAX_DELAY);

        if (received_byte == '[') {
            // Check for the end marker
            uint8_t buffer[8] = {0};
            HAL_UART_Receive(&huart2, buffer, 8, HAL_MAX_DELAY);
            if (strncmp((char *)buffer, "ENDSIGN]", 8) == 0) {
                break;  // Exit the loop
            }
        }

        // Ignore newline and carriage return characters
        if (received_byte != '\r' && received_byte != '\n') {
            message_buffer[msg_index++] = received_byte;
        }
    }

    HAL_UART_Transmit(&huart2, (uint8_t *)"Message Received!\r\n", 19, HAL_MAX_DELAY);

    printf(message_buffer);

    // Compute SHA-256 HASH
    retval = cmox_hash_compute(
        CMOX_SHA256_ALGO,
		message_buffer, msg_index,
        computed_hash,
        CMOX_SHA256_SIZE,
        &computed_size
    );

    if (retval != CMOX_HASH_SUCCESS) {
        HAL_UART_Transmit(&huart2, (uint8_t *)"ERROR: Hashing failed\r\n", 23, HAL_MAX_DELAY);
    } else {
    	print_computed_hash(computed_hash, CMOX_SHA256_SIZE);
    	HAL_UART_Transmit(&huart2, (uint8_t *)"SHA-256 Hash Computed Successfully!\r\n", 38, HAL_MAX_DELAY);
    }

    // Convert hash to hex string for logging
    char hash_hex[65] = {0};
    for (int i = 0; i < CMOX_SHA256_SIZE; i++) {
        sprintf(&hash_hex[i * 2], "%02X", computed_hash[i]);
    }

    // Format log entry
    char cmd[32];
    snprintf(cmd, sizeof(cmd), "SIGN[%d]", current_key_index);
    flash_log_event_with_data(cmd, hash_hex);


    // Initialize ECC context (small memory footprint)
    //cmox_ecc_construct(&ecc_ctx, CMOX_MATH_FUNCS_SMALL, working_buffer, sizeof(working_buffer));

    generate_random_bytes(random_buffer, sizeof(random_buffer));  // Fill buffer with randomness

    // Sign the message hash
    retval = cmox_ecdsa_sign(
        &ecc_ctx,
        CMOX_ECC_CURVE_SECP256R1,
        random_buffer, sizeof(random_buffer),
        private_keys[current_key_index], private_key_lens[current_key_index],
        computed_hash, CMOX_SHA256_SIZE,
        computed_signature, &computed_size
    );


    if (retval == CMOX_ECC_SUCCESS) {
        HAL_UART_Transmit(&huart2, (uint8_t *)"✅ STM32 Self Verification SUCCESS\r\n", 36, HAL_MAX_DELAY);
    } else {
        HAL_UART_Transmit(&huart2, (uint8_t *)"❌ STM32 Self Verification FAILED\r\n", 35, HAL_MAX_DELAY);
    }

    // Clean up ECC context
    //cmox_ecc_cleanup(&ecc_ctx);

    // Check if signing was successful
    if (retval != CMOX_ECC_SUCCESS) {
        char *error_msg = "ERROR: Signing failed\r\n";
        HAL_UART_Transmit(&huart2, (uint8_t *)error_msg, strlen(error_msg), HAL_MAX_DELAY);
        return;
    }

    // Send acknowledgment
    HAL_UART_Transmit(&huart2, (uint8_t *)"[SIGN]\r\n", 8, HAL_MAX_DELAY);

    // Send the ECDSA signature (64 bytes)
    HAL_UART_Transmit(&huart2, computed_signature, SIGNATURE_SIZE, HAL_MAX_DELAY);

    // Send end marker
    HAL_UART_Transmit(&huart2, (uint8_t *)"[ENDSIGN]\r\n", 11, HAL_MAX_DELAY);
}

void key_info(void) {
    char buffer[100];

    for (int i = 0; i < NUM_KEYS; i++) {
        int is_valid = (private_key_lens[i] > 0 && public_key_lens[i] > 0);

        if (is_valid) {
            snprintf(buffer, sizeof(buffer), "Key %d (HEX)%s:\r\n",
                     i, (i == current_key_index) ? " [aktiv]" : "");
            HAL_UART_Transmit(&huart2, (uint8_t *)buffer, strlen(buffer), HAL_MAX_DELAY);

            for (int j = 0; j < ECC_PUBLIC_KEY_SIZE; j++) {
                snprintf(buffer, sizeof(buffer), "%02X", public_keys[i][j]);
                HAL_UART_Transmit(&huart2, (uint8_t *)buffer, 2, HAL_MAX_DELAY);

                if ((j + 1) % 32 == 0)
                    HAL_UART_Transmit(&huart2, (uint8_t *)"\r\n", 2, HAL_MAX_DELAY);
            }

        } else {
            snprintf(buffer, sizeof(buffer), "Key %d: ❌ empty\r\n", i);
            HAL_UART_Transmit(&huart2, (uint8_t *)buffer, strlen(buffer), HAL_MAX_DELAY);
        }
    }
}



