Cult0x7c/HSM-Firmware--STM32-/main.c
void delete_all_keys(void) {
    for (int i = 0; i < NUM_KEYS; i++) {
        memset(private_keys[i], 0, ECC_PRIVATE_KEY_SIZE);
        memset(public_keys[i], 0, ECC_PUBLIC_KEY_SIZE);
        private_key_lens[i] = 0;
        public_key_lens[i] = 0;
    }
    current_key_index = 0;

    HAL_UART_Transmit(&huart2, (uint8_t *)"All keys deleted. Reset to key index 0.\r\n", 42, HAL_MAX_DELAY);
}

void set_rtc_from_command(char *cmd, UART_HandleTypeDef *huart)
{
    int year, month, day, hour, min, sec;

    // Expecting format: "SETRTC YYYY-MM-DD HH:MM:SS"
    if (sscanf(cmd, "SETRTC %d-%d-%d %d:%d:%d",
               &year, &month, &day, &hour, &min, &sec) == 6)
    {
        RTC_TimeTypeDef sTime = {0};
        RTC_DateTypeDef sDate = {0};

        sTime.Hours   = hour;
        sTime.Minutes = min;
        sTime.Seconds = sec;

        sDate.Year  = year - 2000;  // RTC stores 0–99 (for 2000–2099)
        sDate.Month = month;
        sDate.Date  = day;
        sDate.WeekDay = RTC_WEEKDAY_MONDAY;  // Optional: used only if needed

        if (HAL_RTC_SetTime(&hrtc, &sTime, RTC_FORMAT_BIN) == HAL_OK &&
            HAL_RTC_SetDate(&hrtc, &sDate, RTC_FORMAT_BIN) == HAL_OK)
        {
            const char *ok = "✅ RTC updated.\r\n";
            HAL_UART_Transmit(huart, (uint8_t*)ok, strlen(ok), HAL_MAX_DELAY);
        }
        else
        {
            const char *fail = "❌ RTC update failed.\r\n";
            HAL_UART_Transmit(huart, (uint8_t*)fail, strlen(fail), HAL_MAX_DELAY);
        }
    }
    else
    {
        const char *syntax = "❌ Invalid format. Use: SETRTC YYYY-MM-DD HH:MM:SS\r\n";
        HAL_UART_Transmit(huart, (uint8_t*)syntax, strlen(syntax), HAL_MAX_DELAY);
    }
}

void process_command(void) {
    char command_buffer[64] = {0};  // Buffer for command
    size_t index = 0;

    flush_uart_buffer();  // Clear UART buffer

    // Read command until newline ('\n') is received
    while (index < sizeof(command_buffer) - 1) {
        uint8_t byte;
        HAL_UART_Receive(&huart2, &byte, 1, HAL_MAX_DELAY);

        if (byte == '\r' || byte == '\n') {  // Accept both '\n' and '\r\n' {
            command_buffer[index] = '\0';
            break;
        }
        command_buffer[index++] = byte;
    }

    HAL_UART_Transmit(&huart2, (uint8_t *)"\nReceived: ", 11, HAL_MAX_DELAY);
    HAL_UART_Transmit(&huart2, (uint8_t *)command_buffer, strlen(command_buffer), HAL_MAX_DELAY);
    HAL_UART_Transmit(&huart2, (uint8_t *)"\r\n", 2, HAL_MAX_DELAY);

    // Check command and execute corresponding function
    if (strcmp(command_buffer, "GENKEY") == 0) {
        HAL_UART_Transmit(&huart2, (uint8_t *)"Generating new key pairs...\r\n", 29, HAL_MAX_DELAY);
        generate_all_keys();
    }
    else if (strcmp(command_buffer, "SENDPUB") == 0) {
        HAL_UART_Transmit(&huart2, (uint8_t *)"Sending public key...\r\n", 24, HAL_MAX_DELAY);
        send_public_key_to_pc();
    }
    else if (strcmp(command_buffer, "SIGN") == 0) {
        //HAL_UART_Transmit(&huart2, (uint8_t *)"Waiting for message to sign...\r\n", 32, HAL_MAX_DELAY);
        sign_message();
    }
    else if (strcmp(command_buffer, "DELKEYS") == 0) {
        delete_all_keys();
    }
    else if (strcmp(command_buffer, "KEYINFO") == 0) {
        key_info();
    }
    else if (strcmp(command_buffer, "GETLOGS") == 0) {
        flash_log_read(&huart2);
    }
    else if (strncmp((char*)command_buffer, "CLEARLOGS", 9) == 0) {
        flash_log_clear();
    }
    else if (strncmp((char*)command_buffer, "SETRTC", 6) == 0) {
        set_rtc_from_command((char*)command_buffer, &huart2);
    }


    else if (strncmp(command_buffer, "USEKEY", 6) == 0) {
        int key_idx = atoi(&command_buffer[6]);
        if (key_idx >= 0 && key_idx < NUM_KEYS) {
            current_key_index = key_idx;
            char msg[40];
            snprintf(msg, sizeof(msg), "Using key index %d\r\n", current_key_index);
            HAL_UART_Transmit(&huart2, (uint8_t *)msg, strlen(msg), HAL_MAX_DELAY);
        } else {
            HAL_UART_Transmit(&huart2, (uint8_t *)"Invalid key index!\r\n", 21, HAL_MAX_DELAY);
        }
    }

    else if (strcmp(command_buffer, "HELP") == 0) {
        HAL_UART_Transmit(&huart2, (uint8_t *)
            "\nCommands:\n"
            "GENKEY  - Generate ECDSA key pair\r\n"
            "SENDPUB - Send public key\r\n"
            "SIGN    - Sign a received message\r\n"
            "HELP    - Show this menu\r\n",
            100, HAL_MAX_DELAY);
    }
    else {
        HAL_UART_Transmit(&huart2, (uint8_t *)"Unknown command. Type HELP for list.\r\n", 38, HAL_MAX_DELAY);
    }
}




/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  * @retval int
  */
int main(void)
{

  /* USER CODE BEGIN 1 */

  /* USER CODE END 1 */

  /* MCU Configuration--------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_DMA_Init();
  MX_USART2_UART_Init();
  MX_CRC_Init();
  MX_RNG_Init();
  MX_RTC_Init();
  /* USER CODE BEGIN 2 */


  const char *welcome_message = "\r\nWelcome to HSM Firmware on STM32G474RE\r\n";
  HAL_UART_Transmit(&huart2, (uint8_t *)welcome_message, strlen(welcome_message), HAL_MAX_DELAY);



  /* generate ecc key pair
  generate_ecdsa_key_pair();

  // send public key to pc
  send_public_key_to_pc();

  //get sign request
  process_sign_request();

  */
  //  cmox_ecc_cleanup(&Ecc_Ctx);
  // wait to receive message (to get signed)
  /* USER CODE END 2 */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */

  /* Buffer and input control variables */


  while (1)
  {
	  /*
	  printf("test\n");
	  HAL_Delay(1000);*/
	  //flash_log_event_with_data("BOOT", "OK");

	  flash_log_init();  // Holt den letzten gültigen Hash
	  process_command();
	  HAL_UART_Transmit(&huart2, (uint8_t *)"\nWaiting for command...\r\n", 26, HAL_MAX_DELAY);

    /* USER CODE END WHILE */

